<?php

namespace Database\Seeders;

use App\Models\ProductUnit;
use Illuminate\Database\Seeder;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;

class ProductUnitSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $units = [
            'بانكه',
            'برگ',
            'بسته',
            'بشكه',
            'بطری',
            'بندیل',
            'پاکت',
            'پالت',
            'تانكر',
            'تخته',
            'تن',
            'تن کیلومتر',
            'توپ',
            'تیوب',
            'ثانیه',
            'ثوب',
            'جام',
            'جعبه',
            'جفت',
            'جلد',
            'چلیك',
            'حلب',
            'حلقه (رول)',
            'حلقه (دیسک)',
            'حلقه (رینگ)',
            'دبه',
            'دست',
            'دستگاه',
            'دقیقه',
            'دوجین',
            'روز',
            'رول',
            'ساشه',
            'ساعت',
            'سال',
            'سانتی متر',
            'سانتی متر مربع',
            'سبد',
            'ست',
            'سطل',
            'سیلندر',
            'شاخه',
            'شانه',
            'شعله',
            'شیت',
            'صفحه',
            'طاقه',
            'طغرا',
            'عدد',
            'عدل',
            'فاقد بسته بندی',
            'فروند',
            'فوت مربع',
            'قالب',
            'قراص',
            'قراصه (bundle)',
            'قرقره',
            'قطعه',
            'قوطي',
            'قیراط',
            'کارتن',
            'کارتن (master case)',
            'کلاف',
            'کپسول',
            'کیسه',
            'کیلوگرم',
            'کیلومتر',
            'کیلووات ساعت',
            'گالن',
            'گرم',
            'گیگابایت بر ثانیه',
            'لنگه',
            'لیتر',
            'لیوان',
            'ماه',
            'متر',
            'متر مربع',
            'متر مكعب',
            'مخزن',
            'مگاوات ساعت',
            'میلی گرم',
            'میلی لیتر',
            'میلی متر',
            'نخ',
            'نسخه (جلد)',
            'نفر',
            'نفر- ساعت',
            'نوبت',
            'نیم دوجین',
            'واحد',
            'ورق',
            'ویال',
        ];

        foreach ($units as $unit) {
            ProductUnit::create([
                'name' => $unit,
                'tax' => 0, // مقدار پیش فرض برای مالیات
            ]);
        }
    }
}
